app/controllers/leave_controller.rb

  def index
    @leave = current_user.leaves.all
---
SELECT "leaves".* FROM "leaves" WHERE "leaves"."user_id" = ?  [["user_id", 11]]

  def create
    if current_user.nil?
      session[:form_data] = leave_params
      redirect_to new_user_registration_path
    else
    @leave = Leave.new(leave_params)
    @leave.user_id = current_user.id
    respond_to do |format|
      if @leave.save
---
INSERT INTO "leaves" ("title", "start_date", "no_of_days", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "fsjd"], ["start_date", "2017-12-05"], ["no_of_days", 1], ["reason", "KFKSKFKL"], ["created_at", "2017-05-10 08:47:17.643665"], ["updated_at", "2017-05-10 08:47:17.643665"]]

    def set_leave
      @leave = Leave.find(params[:id])
---
SELECT  "leaves".* FROM "leaves" WHERE "leaves"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]